Repository: common-repository/ads-automated-creator-by-clever-ads
Catalog: languages/google-ads-automated-creator-by-clever-ads-*.po
Languages: es_es

source: Google Ads Creator
es_es: Creador de Google Ads

source: Have your Google Ads created for free by Clever Ads
es_es: Crea automáticamente tus anuncios de Google gratis con Clever Ads

source: Advertise your Wordpress website on Google.
es_es: Empieza a anunciar tu página de WordPress en Google.

source: Simple, hassle-free campaign creation flow.
es_es: Ten tus anuncios creados y listos sin apenas mover un dedo.

source: Doesn't matter what your business is about, reach the right people with Clever Ads.
es_es: No importa cuál sea tu negocio, llega a las personas adecuadas con Clever Ads.

source: CREATE MY GOOGLE ADS FOR FREE
es_es: CREAR MIS ANUNCIOS DE GOOGLE GRATIS

source: Let us in
es_es: Conécta

source: Give us access so we can create and upload your Google Ads campaigns to your account. (See <a class="link" href="https://cleverads.com/privacy-policy">privacy policy</a>)
es_es: Danos acceso a tu cuenta de Google Ads para crear y subir tus campañas cuando esten listas. (Ver <a class="link" href="https://cleverads.com/privacy-policy">Política de Privacidad)</a>

source: Help us build your ads
es_es: Ayúdanos a crear tus anuncios

source: Answer some questions about your business & Google Ads preferences. Clever Ads will create tailor-made ads for you.
es_es: Te haremos algunas preguntas sobre tu negocio y tus preferencias publicitarias para poder crear anuncios a medida para ti.

source: Have your Google Ads running! Your budget will be fully spent on your ads, we won't charge you a penny.
es_es: ¡Empieza a anunciarte ya! Invertiremos todo tu presupuesto en tus anuncios, sin comisiones ni letra pequeña.

source: Created with love by Clever Ads, a Premier Google Partner
es_es: Diseñado con mucho amor por Clever Ads, un Premier Google Partner
